{
	"landing": {
		"firstName": "Sovanmony",
		"lastName": "Lim",
		"phoneNumber": "(978)996-3370",
		"bio": "Hello, I am a recent Computer Science and minor Management graduate from University of Massachusetts Lowell. Experienced in Software Development, Web-Development, Technical Support, and history of working in the Financial Services and Information Technology industry. Interested in modern technologies like AI, Machine Learning, IoT, and Computational Finance. I enjoy learning about the newest emerging technologies and applications in the real world. My purpose is to utilize my knowledge and skill to the advantage of leading companies that aspire to cause a change in the world. Looking forward to making the world a better place for EVERYONE! ",
		"email": "l.sovanmony@gmail.com",
		"linkedin": "https://www.linkedin.com/in/smonylim/",
		"github": "https://github.com/SMony-L"
	},
	"experience": [
		{
			"position": "Enterprise Architecture Co-op",
			"organization": "MFS Investment Management",
			"aboutWork": "Implemented Enterprise Architect Review Board with Kanban board in Jira to aid process efficiency. Collaborated with an Application System Engineer to automate transitions, fields update, email assignments, conditions and validations of project workflows in Groovy with ScriptRunner. Developed and Implemented custom fields with JavaScript in Jira project to create association between BMC Remedy ITSM tool and Salesforce SRM ticketing system. Utilized an enterprise business intelligence tool “MicroStrategy BI” to generate interactive monthly and quarterly dashboards",
			"fromDate": "January 2019",
			"toDate": "December 2019"
		},
		{
			"position": "Information Technology Student Technician",
			"organization": "University of Massachusetts Lowell",
			"aboutWork": "Applied images, installed software, configured devices for deployment for staff and faculty devices. Troubleshot and modified both hardware and software issues for staff and faculty computers. Maintained confidentiality and integrity of information residing on client’s systems as well as physical security of those systems. Collaborated with support engineers to maintain Digital Learning Center Labs for 490+ computers between two campuses",
			"fromDate": "May 2018",
			"toDate": "December 2018"
		},
		{
			"position": "Co-Founder",
			"organization": "DAB X (Social Media Online Shop provides: Authentic | High-Quality | Luxurious | Limited Edition | Super Rare - Clothing and Footwear)",
			"aboutWork": "Conducted retail activities such as prepared business strategies, managed inventory, implemented marketing activities, fulfilled and shipped online orders. Acted as the primary point of contact for customers including orders, order inquiries, shipping inquiries, returns, and complaints. Managed online store revenue including cash handling and ensured an accurate to all payment processing and refunds",
			"fromDate": "January 2017",
			"toDate": "December 2018"
		},
		{
			"position": "Information Technology Support Technician",
			"organization": "American University of Phnom Penh",
			"aboutWork": "Assisted IT department manager and provided technical support to students and professors for campus enrolling 300 students. Resolved computer hardware and software, printing, installation, and operating system issues",
			"fromDate": "May 2016",
			"toDate": "July 2016"
		},
		{
			"position": "Software Developer Intern",
			"organization": "ArrowDot Co., Ltd",
			"aboutWork": "Collaborated on a software development team of four to create a software application for a robot to serve customers in a local coffee shop. Modified and debugged robotic programming with Java testing framework TestNG and Junit. Designed a café menu application in Java with Android Studio to aid efficient ordering",
			"fromDate": "January 2015",
			"toDate": "March 2015"
		}
	],
	"education": [{
			"university": "University of Massachusetts Lowell",
			"degree": "Bachelor of Science",
			"major": "Computer Science with minor Business Management",
			"fromDate": "August 2016",
			"toDate": "December 2019"
		}
	],
		"skills": [{
			"name": "C/C++"
		},
		{
			"name": "Python"
		},
		{
			"name": "Java"
		},
		{
			"name": "HTML5"
		},
		{
			"name": "CSS3"
		},
		{
			"name": "Javascript"
		},
		{
			"name": "MySQL"
		},
		{
			"name": "ReactJS"
		},
		{
			"name": "Git"
		},
		{
			"name": "GitHub"
		},
		{
			"name": "Docker"
		},
		{
			"name": "Jira"
		},
		{
			"name": "Confluence"
		},
		{
			"name": "Familiar with Swift"	
		},
		{
			"name": "Familiar with Groovy"
		},
		{
			"name": "Exposure to Azure"
		},
		{
			"name": "Exposure to AWS"
		},
		{
			"name": "Linux"
		},
		{
			"name": "Windows"
		},
		{
			"name": "Mac OS"
		},
		{
			"name": "Terminal"
		},
		{
			"name": "Android Studio"
		},
		{
			"name": "Anaconda"
		},
		{
			"name": "Learning and Exploring Kubernetes"
		}
	],
	"projects": [{
		"title": "AI Pac Man",
		"projectLang": "Python",
		"aboutProject": "Implemented Pac-Man agents using artificial intelligent algorithms such as DFS, BFS, A* search, alpha-beta pruning, minimax, expectimax and a model free reinforcement learning algorithm. Designed strategies for the agents to play a multi-player capture-the-flag variant of Pacman."
	}, 
	{
		"title": "Solving Classification and Regression Problems Using Machine and Deep Learning",
		"projectLang": "Python",
		"aboutProject": "Collaborated in a team of four to analyze datasets from Scikit-learn library with linear regression, multivariate regression, decision tree, SVM and multi-layer perception classifier. Analyzed and generated ad-hoc reports with Jupyter Notebook and Latex"
	}, 
	{
		"title": "Memory allocation and memory free operation",
		"projectLang": "C++",
		"aboutProject": "The allocation and free operations will be made against an initially empty fixed sized free memory pool. The program must support three allocation policies: First fit linked list, Best fit linked list, Buddy system power of 2 block allocation (using a minimum allocation of 32 bytes)"
	}
	]	

}
