{
	"landing": {
		"firstName": "Sovanmony",
		"lastName": "Lim",
		"phoneNumber": "(978)996-3370",
		"bio": "Hello, I am a recent Computer Science and minor Management graduate from University of Massachusetts Lowell. Experienced in Software Development, Web-Development, Technical Support, and history of working in the Financial Services and Information Technology industry. Interested in modern technologies like AI, Machine Learning, IoT, and Computational Finance. I enjoy learning about the newest emerging technologies and applications in the real world. My purpose is to utilize my knowledge and skill to the advantage of leading companies that aspire to cause a change in the world. Looking forward to making the world a better place for EVERYONE! ",
		"email": "l.sovanmony@gmail.com",
		"linkedin": "https://www.linkedin.com/in/smonylim/",
		"github": "https://github.com/SMony-L"
	},
	"experience": [
		{
			"position": "Enterprise Architecture Co-op (Application Engineer)",
			"organization": "MFS Investment Management",
			"aboutWork": "Designed, implemented, and maintained Enterprise Architecture Kanban boards using Jira in development, stage, and production environment to expedite review process, which results in a 20% increase in efficiency. Collaborated with Application Engineer Specialists to develop automated transitions, fields update, email assignments, conditions, and validations of project workflows in Groovy using ScriptRunner. Developed and implemented custom fields using JavaScript in Jira projects to create real-time synchronization between BMC Remedy ITSM tool and Salesforce SRM ticketing system. Analyzed system database, developed application models, and generated interactive reports using MicroStrategy BI for monthly and quarterly dashboards",
			"fromDate": "January 2019",
			"toDate": "December 2019"
		},
		{
			"position": "Information Technology Technician",
			"organization": "University of Massachusetts Lowell",
			"aboutWork": "Applied images, installed software, and configured devices for over 200 deployment of staff and faculty. Troubleshot, diagnosed, and resolved ranging from software to hardware to connectivity issues. Maintained confidentiality and integrity of information residing on clients’ systems as well as their physical security. Collaborated with Support Engineers to maintain over 490 computers in Digital Learning Center labs",
			"fromDate": "May 2018",
			"toDate": "December 2018"
		},
		{
			"position": "Co-Founder",
			"organization": "DAB X (Social Media Online Shop provides: Authentic | High-Quality | Luxurious | Limited Edition | Super Rare - Clothing and Footwear)",
			"aboutWork": "Conducted retail activities such as prepared business strategies, managed inventory, implemented marketing activities, fulfilled and shipped online orders. Acted as the primary point of contact for customers including orders, order inquiries, shipping inquiries, returns, and complaints. Managed online store revenue including cash handling and ensured an accurate to all payment processing and refunds",
			"fromDate": "January 2017",
			"toDate": "December 2018"
		},
		{
			"position": "Information Technology Support Technician",
			"organization": "American University of Phnom Penh",
			"aboutWork": "Worked closely with IT department manager and provided on-site technical support to students and professors. Resolved hardware and software issues such as operating system configuration, password reset, and printer hook-ups",
			"fromDate": "January 2016",
			"toDate": "July 2016"
		},
		{
			"position": "Software Engineer Intern",
			"organization": "ArrowDot Co., Ltd",
			"aboutWork": "Collaborated in an agile development team to develop, test, and deploy new software patches such as bug fixes, enhanced usability, proposed improvements, and updated documentation. Supported Mobile Application Engineers in planning, designing, developing, and implementing a high-performance user-friendly mobile application",
			"fromDate": "January 2015",
			"toDate": "March 2015"
		}
	],
	"education": [{
			"university": "University of Massachusetts Lowell",
			"degree": "Bachelor of Science",
			"major": "Computer Science with minor Business Management",
			"fromDate": "September 2016",
			"toDate": "December 2019"
		}
	],
		"skills": [{
			"name": "C/C++"
		},
		{
			"name": "Python"
		},
		{
			"name": "Java"
		},
		{
			"name": "HTML5"
		},
		{
			"name": "CSS3"
		},
		{
			"name": "Javascript"
		},
		{
			"name": "MySQL"
		},
		{
			"name": "ReactJS"
		},
		{
			"name": "Git"
		},
		{
			"name": "GitHub"
		},
		{
			"name": "Docker"
		},
		{
			"name": "Jira"
		},
		{
			"name": "Confluence"
		},
		{
			"name": "Familiar with Swift"	
		},
		{
			"name": "Familiar with Groovy"
		},
		{
			"name": "Exposure to Azure"
		},
		{
			"name": "Exposure to AWS"
		},
		{
			"name": "Linux"
		},
		{
			"name": "Windows"
		},
		{
			"name": "Mac OS"
		},
		{
			"name": "Terminal"
		},
		{
			"name": "Android Studio"
		},
		{
			"name": "Anaconda"
		},
		{
			"name": "Exposure to RESTful API"
		},
		{
			"name": "Learning and Exploring Kubernetes"
		}
	],
	"projects": [{
		"title": "AI Pac Man",
		"projectLang": "Python",
		"aboutProject": "Implemented various AI techniques such as DFS, BFS, UCS, A*, alpha-beta pruning, minimax, expectimax, MDP, and Q-learning for the game of Pac-Man. Designed strategies for the agents to play a multi-player capture-the-flag variant of Pacman."
	}, 
	{
		"title": "Solving Classification and Regression Problems Using Machine and Deep Learning",
		"projectLang": "Python",
		"aboutProject": "Collaborated in a team of four to analyze datasets from Scikit-learn library with linear regression, multivariate regression, decision tree, SVM and multi-layer perception classifier. Analyzed and generated ad-hoc reports with Jupyter Notebook and Latex"
	}, 
	{
		"title": "Memory allocation and memory free operation",
		"projectLang": "C++",
		"aboutProject": "The allocation and free operations will be made against an initially empty fixed sized free memory pool. The program must support three allocation policies: First fit linked list, Best fit linked list, Buddy system power of 2 block allocation (using a minimum allocation of 32 bytes)"
	}
	]	

}
